{
    "foods": [
              { "foodName" : "Masala Dosa",
              "ingredients" : "FOR THE DOSA BATTER: 2 cups short-grain rice + ½ cup urad dal (split husked black lentils) + 1 teaspoon fenugreek seeds + ½ teaspoon salt + Vegetable oil, for frying, FOR THE POTATO FILLING: 3 tablespoons ghee or vegetable oil + 1 teaspoon mustard seeds + ½ teaspoon cumin seeds + 2 small dried hot red peppers +1 medium onion, diced + ½ teaspoon salt + ½ teaspoon turmeric + Pinch of asafetida + 1 tablespoon grated ginger + 6 to 8 curry leaves + 4 garlic cloves, minced + 2 small green chiles, finely chopped + 1 ½ pounds yellow-fleshed potatoes, such as Yukon Gold, boiled, peeled and cubed + ½ cup roughly chopped cilantro, leaves and tender stems",
              "time" : "1 hour, plus 12 to 14 hours’ soaking and fermenting",
              "steps" : "Step 1:  Make the dosa batter: Put rice in a bowl, rinse well and cover with 4 cups cold water. Put urad dal and fenugreek seeds in a small bowl, rinse well and add cold water to cover. Leave both to soak for 4 to 6 hours. --- Step 2: Drain rice and dal-fenugreek mixture in separate colanders. Put rice in a food processor, blender or wet-dry grinder. Add 1 cup cold water and grind to a smooth paste. It will take about 10 minutes, and it may be necessary to work in batches. Repeat the process with the dal-fenugreek mixture. --- Step 3: Combine the two pastes in a medium mixing bowl. Whisk together, adding enough water to obtain a medium-thick batter. You should have about 6 cups. Cover bowl with a kitchen towel and set in a warm place. Let ferment until the surface is bubbly, about 8 hours. Stir in the salt. Use the batter straight away or refrigerate for later use. (Batter will keep for up to a week, refrigerated. Thin with water if necessary before proceeding.) --- Step 4: Make the potato filling: Put ghee in a wide skillet over medium heat. When oil is wavy, add mustard seeds and cumin seeds. Wait for seeds to pop, about 1 minute, then add red peppers and onion. Cook, stirring until onions have softened, about 5 minutes. Season lightly with salt. Add turmeric, asafetida, ginger, curry leaves, garlic and green chile. Stir to coat and let sizzle for 1 minute.--- Step 5: Add potatoes and 1/2 cup water. Cook, stirring well to combine, until liquid has evaporated, about 5 minutes. Mash potatoes a bit with the back of a wooden spoon. Season well with salt, add cilantro, then set aside at room temperature. (Potato filling may be prepared up to a day in advance.) --- Step 6: To make dosas, set a griddle or cast-iron skillet over medium heat. Brush with about 1 teaspoon vegetable oil. Ladle 1/4 cup batter in the center of griddle. Using bottom of ladle, quickly spread batter outward in a circular motion to a diameter of about 7 inches. Drizzle 1/2 teaspoon oil over the top. Leave dosa batter to brown gradually until outer edges begin to look dry, about 2 minutes, cooking on one side only. With a spatula, carefully loosen dosa from griddle. Bottom should be crisp and beautifully browned. Spoon 1/2 cup potato filling onto top of dosa, centering it as a strip in the middle of the round dosa. Flatten the potato mixture slightly. Using the spatula, fold the sides of the dosa around the filling to make a cylindrical shape. Serve immediately. Continue making dosas one at a time.",
              "foodImage": "MasalaDosa",
              "review":"0"
              },
              { "foodName" : "Som tam",
              "ingredients" : "2 cups of shredded green papaya (or swede/rutabaga) + 2 tbs of toasted peanuts + 2 cloves of peeled garlic + 1-2 fresh birds eye chili (or more depending on tolerance) + 1 tbs of dried shrimp + ½ piece palm sugar + 7 cherry tomatoes + juice of ½ lime + 1½ tbs of fish sauce + 1-2 tbs Thai snake beans (or green beans) cut into 1 inch sticks",
              "time" : "30 minutes",
              "steps" : "Step 1:  Roughly crush a small handful of unsalted peanuts with mortar and pestle. Set aside. Wipe the mortar and pestle clean. --- Step 2: Melt palm sugar in a small pan at low or medium heat, adding 2 tbs of water. The cooking process should form a shiny and thick syrup. This makes it easier to mix the sugar with the salad. --- Step 3: Peel the papaya (or swede), shred it with a shredder (or a mandolin slicer) to thin strips and soak them in cold water while you prepare the rest of the salad. This makes the papaya crunchier and gets rid of any excess starch from the swede. --- Step 4: Cut the green beans into one-inch pieces. Throw away the endings. --- Step 5: Take the chilies and peeled garlic and give them a gentle bash with mortar and pestle. You still ought to see bits and pieces, not a puree. Add the shrimp and continue bashing. Add the crushed peanuts and mix well --- Step 6:Add the shredded papaya and continue bashing, but not too hard. Just enough so the mixture soaks up the flavours. Use a bigger spoon as a support tool, that way you can shift the salad in the mortar and it doesn’t fall out while bashing and mixing. --- Step 7: Add the liquid palm sugar, tomatoes, beans, lime juice and fish sauce. Continue to lightly bash, shift with the spoon, and mix a little more. --- Step 8: Serve on a big dish or bowl, sprinkle some crushed peanuts on top! Voila!",
              "foodImage": "som tam",
              "review":"1"
              },
              {
              "foodName": "Poutine",
              "ingredients": "1 quart vegetable oil for frying + 1 (10.25 ounce) can beef gravy + 5 medium potatoes, cut into fries + 2 cups cheese curds",
              "time" : "25 mins",
              "steps": "Step 1: Heat oil in a deep fryer or deep heavy skillet to 365 degrees F (185 degrees C). While the oil is heating, you can begin to warm your gravy. --- Step 2: Place the fries into the hot oil, and cook until light brown, about 5 minutes. Make the fries in batches if necessary to allow them room to move a little in the oil. Remove to a paper towel lined plate to drain. --- Step 3: Place the fries on a serving platter, and sprinkle the cheese over them. Ladle gravy over the fries and cheese, and serve immediately.",
              "foodImage": "poutine",
              "review":"2"
},
              {
              "foodName": "Zesty Carnitas Tacos",
              "ingredients": "½ cup chopped onion: 1 (2 pound) boneless pork shoulder roast + ½ cup chopped onion + ⅓ cup orange juice + 1 tablespoon cumin + 1 ½ teaspoons kosher salt + 1 teaspoon dried oregano, crushed + ¼ teaspoon cayenne pepper, Lime Crema: 1 lime, zested and juiced + 2 (5.3 ounce) containers plain fat-free Greek yogurt + ½ teaspoon kosher salt + 1 pinch chili powder (Optional), Tacos: 16 (6 inch) soft yellow corn tortillas + 4 leaves green cabbage, shredded + 1 cup very thinly sliced red onion + 1 cup pico de gallo (Optional.",
              "time": "4 hrs 30 mins, for 8 people.",
              "steps": "Step 1: Carnitas: Trim fat from pork. Cut pork into 2- to 3-inch pieces; transfer to a 4-quart slow cooker. Stir in onion, orange juice, cumin, 1 1/2 teaspoons salt, oregano, and cayenne. --- Step 2: Cover and cook on Low 8 to 10 hours, or on High 4 to 5 hours. Transfer pork to a large bowl; shred using 2 forks. Add enough cooking liquid from slow cooker to moisten. --- Step 3: Lime Crema: Add 2 tablespoons lime juice to a small bowl. Stir in yogurt and 1/2 teaspoon salt. Dust with chili powder. --- Step 4: Tacos: Serve pork in tortillas with cabbage, red onion, and pico de gallo (if using). Garnish with crema and lime zest.",
              "foodImage": "Zesty Carnitas Tacos",
              "review":"3"
              },
              {
              "foodName": "Hummus",
              "ingredients":"2 cloves garlic, divided + 1 (19 ounce) can garbanzo beans, half the liquid reserved + 4 tablespoons lemon juice + 2 tablespoons tahini + 1 teaspoon salt + black pepper to taste + 2 tablespoons olive oil.",
              "time":"15 mins",
              "steps":"Step 1: In a blender, chop garlic. Pour garbanzo beans into the blender, reserving about 1 tablespoon for garnish. Add reserved liquid, lemon juice, tahini, and salt to the blender. Blend until creamy and well mixed. --- Step 2: Transfer the mixture to a medium serving bowl. Sprinkle with pepper and pour olive oil over the top. Garnish with reserved garbanzo beans.",
              "foodImage": "hummus",
              "review":"4"
              },
              {
              "foodName":"Maple syrup",
              "ingredients":"1 cup water + 1 cup white sugar + 1 cup brown sugar + 1 tablespoon maple flavored extract.",
              "time":"10 mins",
              "steps":"Step 1: Bring the water, white sugar, and brown sugar to a boil in a saucepan over medium-high heat. Reduce heat to medium-low, and stir in the maple extract; simmer 3 minutes longer.",
              "foodImage":"mappleSyrup",
              "review":"5"
              },
              {
              "foodName":"Authentic Pho",
              "ingredients":"4 pounds beef soup bones + 1 onion, unpeeled and cut in half + 5 slices fresh ginger + 1 tablespoon salt + 2 pods star anise + 2 ½ tablespoons fish sauce + 4 quarts water + 1 (8 ounce) package dried rice noodles + 1 ½ pounds beef top sirloin, thinly sliced + ½ cup chopped cilantro + 1 tablespoon chopped green onion + 1 ½ cups bean sprouts + 1 bunch Thai basil + 1 lime, cut into 4 wedges + ¼ cup hoisin sauce (Optional) + ¼ cup chile-garlic sauce (such as Sriracha®) (Optional).",
              "time":"9 hrs 20 mins, for 4 people.",
              "steps":"Step 1: Preheat oven to 425 degrees F (220 degrees C). --- Step 2: Place beef bones on a baking sheet and roast in the preheated oven until browned, about 1 hour. --- Step 3: Place onion on a baking sheet and roast in the preheated oven until blackened and soft, about 45 minutes. --- Step 4: Place bones, onion, ginger, salt, star anise, and fish sauce in a large stockpot and cover with 4 quarts of water. Bring to a boil and reduce heat to low. Simmer on low for 6 to 10 hours. Strain the broth into a saucepan and set aside. --- Step 5: Place rice noodles in large bowl filled with room temperature water and allow to soak for 1 hour. Bring a large pot of water to a boil and after the noodles have soaked, place them in the boiling water for 1 minute. Bring stock to a simmer. --- Step 6: Divide noodles among 4 serving bowls; top with sirloin, cilantro, and green onion. Pour hot broth over the top. Stir and let sit until the beef is partially cooked and no longer pink, 1 to 2 minutes. Serve with bean sprouts, Thai basil, lime wedges, hoisin sauce, and chile-garlic sauce on the side.",
              "foodImage":"Authentic Pho",
              "review":"6"
              },
              {
              "foodName":"Lasagna",
              "ingredients":"1 pound sweet Italian sausage + ¾ pound lean ground beef + ½ cup minced onion + 2 cloves garlic, crushed + 1 (28 ounce) can crushed tomatoes + 2 (6 ounce) cans tomato paste + 2 (6.5 ounce) cans canned tomato sauce + ½ cup water + 2 tablespoons white sugar + 1 ½ teaspoons dried basil leaves + ½ teaspoon fennel seeds + 1 teaspoon Italian seasoning + 1 ½ teaspoons salt, divided, or to taste + ¼ teaspoon ground black pepper + 4 tablespoons chopped fresh parsley + 12 lasagna noodles + 16 ounces ricotta cheese + 1 egg + ¾ pound mozzarella cheese, sliced + ¾ cup grated Parmesan cheese.",
              "time":"2 hrs 75 mins",
              "steps":"Step 1: In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 teaspoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally. --- Step 2: Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt. --- Step 3: Preheat oven to 375 degrees F (190 degrees C). --- Step 4: To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish. Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese. --- Step 5: Bake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving.",
              "foodImage":"lasagna",
              "review":"7"
              },
              {
              "foodName":"Noodle Bowls",
              "ingredients":"1 (8 ounce) package dried cellophane (glass) noodles + 1 cup peanuts + 1 head heart of romaine lettuce, shredded + 1 cucumber, cut into matchsticks + 2 carrots, cut into matchsticks + 1 cup mung bean sprouts + 1 cup cilantro leaves, chopped + 1 cup fresh mint leaves, slivered + ½ cup chopped green onions + ½ cup soy sauce, or to taste + 1 teaspoon wasabi paste, or to taste.",
              "time":"45 mins",
              "steps":"Step 1: Place noodles in a large bowl and cover with very hot water. Let stand until softened, about 15 minutes. Drain and chop into shorter lengths. --- Step 2: Grind peanuts into a coarse, chunky meal using a food processor or mortar and pestle. --- Step 3: Combine noodles, peanuts, lettuce, cucumber, carrots, bean sprouts, cilantro, mint, and green onions in a large bowl. Serve soy sauce and wasabi paste alongside.",
              "foodImage":"noodleBowls",
              "review":"8"
              },
              {
              "foodName":"Ahi Poke Basic",
              "ingredients":"2 pounds fresh tuna steaks, cubed + 1 cup soy sauce + ¾ cup chopped green onions + 2 tablespoons sesame oil + 1 tablespoon toasted sesame seeds + 1 tablespoon crushed red pepper (Optional) + 1 tablespoon crushed red pepper (Optional).",
              "time":"2 hrs 15 mins",
              "steps":"Step 1: In a medium size non-reactive bowl, combine Ahi, soy sauce, green onions, sesame oil, sesame seeds, chili pepper, and macadamia nuts; mix well. Refrigerate at least 2 hours before serving.",
              "foodImage":"Ahi Poke Basic",
              "review":"9"
              },
              {
              "foodName":"Croissants",
              "ingredients":"1 ¼ teaspoons active dry yeast + 3 tablespoons warm water (110 degrees F/45 degrees C) + 1 teaspoon white sugar + 1 ¾ cups all-purpose flour + 2 teaspoons white sugar + 1 ½ teaspoons salt + ⅔ cup warm milk + 2 tablespoons vegetable oil + ⅔ cup unsalted butter, chilled + 1 egg + 1 tablespoon water.",
              "time":"10 hrs 75 mins",
              "steps":" Step 1: Combine yeast, warm water, and 1 teaspoon sugar. Allow to stand until creamy and frothy. --- Step 2: Measure flour into a mixing bowl. Dissolve 2 teaspoons sugar and salt in warm milk. Blend into flour along with yeast and oil. Mix well; knead until smooth. Cover, and let rise until over triple in volume, about 3 hours. Deflate gently, and let rise again until doubled, about another 3 hours. Deflate and chill 20 minutes. --- Step 3: Massage butter until pliable, but not soft and oily. Pat dough into a 14x8-inch rectangle. Smear butter over top two thirds, leaving 1/4-inch margin all around. Fold unbuttered third over middle third, and buttered top third down over that. Turn 90 degrees, so that folds are to left and right. Roll out to a 14x6-inch rectangle. Fold in three again. Sprinkle lightly with flour, and put dough in a plastic bag. Refrigerate 2 hours. Unwrap, sprinkle with flour, and deflate gently. Roll to a 14x6-inch rectangle, and fold again. Turn 90 degrees, and repeat. Wrap, and chill 2 hours. --- Step 4: To shape, roll dough out to a 20x5-inch rectangle. Cut in half crosswise, and chill half while shaping the other half. Roll out to a 15 x 5 inch rectangle. Cut into three 5 x 5 inch squares. Cut each square in half diagonally. Roll each triangle lightly to elongate the point, and make it 7 inches long. Grab the other 2 points, and stretch them out slightly as you roll it up. Place on a baking sheet, curving slightly. Let shaped croissants rise until puffy and light. In a small bowl, beat together egg and 1 tablespoon water. Glaze croissants with egg wash. --- Step 5: Bake in a preheated 475 degrees F (245 degrees C) oven for 12 to 15 minutes.",
              "foodImage":"Croissants",
              "review":"10"
              },
              {
              "foodName":"Portuguese Custard Tarts (Pasteis de Nata)",
              "ingredients":"For the Dough: 1 cup all-purpose flour + ¼ teaspoon kosher salt + ⅓ cup cold water + 1 stick high-quality unsalted butter, fully softened, divided.  For the Sugar Syrup: ¾ cup white sugar + ¼ cup water + 1 tablespoon water + 1 cinnamon stick (Optional) + 1 lemon, zested in large strips (Optional).  For the Custard Base: ⅓ cup all-purpose flour + ¼ teaspoon kosher salt + 1 ½ cups milk + 6 large egg yolks + 1 teaspoon vanilla extract (Optional).",
              "time":"3 hrs 60 mins",
              "steps":"Step 1: Combine flour, salt, and cold water in a bowl. Mix with a wooden spoon until dough just comes together and pulls away from the sides of the bowl. Dough should be sticky; adjust with more flour or water to achieve what's shown in the video. --- Step 2: Transfer dough onto a well floured surface. Dust a little more flour over the top. Knead for a minute or two to form a round. Cover and let rest for 15 to 20 minutes. --- Step 3: Roll dough into a square about 1/8 inch thick, dusting with flour as necessary; dough should still be sticky. --- Step 4: Spread 1/3 of the butter over 2/3 of the square using a silicone spatula, leaving a 1/2 inch border. Flip the unbuttered side over the middle of the square and fold the opposite end over it like a letter. Straighten the edges as needed. --- Step 5: Turn dough with a bench scraper to unstick it from the counter; dust with flour. Flip and sprinkle more flour on top. Roll dough into a 1/8-inch-thick rectangle, carefully stretching edges as needed. Spread another 1/3 of the butter over 2/3 of the dough. Fold into thirds. Transfer onto a lined baking sheet and freeze until butter is slightly chilled, about 10 minutes. --- Step 6: Sprinkle dough with flour and roll into a square a little over 1/8 inch thick. Spread remaining butter over the dough, leaving a 1- to 1 1/2-inch border on the top edge. Dip your finger in water and lightly moisten the unbuttered edge. Roll dough into a log starting from the bottom edge. Dust with more flour and polish the ends as needed. Seal with plastic wrap and refrigerate at least 2 hours, preferably overnight. --- Step 7: Combine sugar, 1/4 cup plus 1 tablespoon water, cinnamon, and lemon zest in a pot. Boil over medium heat, without stirring, until syrup reaches 210 to 215 degrees F (100 degrees C). Remove from heat. --- Step 8: Preheat oven 550 degrees F (288 degrees C). Grease a 12-cup muffin tin. --- Step 9: Whisk flour, salt, and cold milk together very thoroughly in a cold pot. Cook over medium heat, whisking constantly, until milk thickens, about 5 minutes. Remove from heat and let cool for at least 10 minutes. --- Step 10: Whisk egg yolks into the cooled milk. Add the sugar syrup and vanilla extract. Mix until combined. Strain custard into a glass measuring cup. --- Step 11: Unwrap the dough and trim any uneven bits on the ends. Score log into 12 even pieces using a knife; cut through. --- Step 12: Place a piece of dough in each muffin cup. Dip your thumb lightly in some cold water. Press thumb into the center of the swirl; push dough against the bottom and up the sides of the cup until it reaches least 1/8 inch past the top. Fill each cup 3/4 of the way with custard. --- Step 13: Bake in the preheated oven until the pastry is browned and bubbly, and the tops start to blister and caramelize, about 12 minutes. Cool tarts briefly and serve warm.",
              "foodImage":"Portuguese Custard Tarts (Pasteis de Nata)",
              "review":"11"
              },
              {
              "foodName":"Sichuan (Szechuan) Cold Noodle",
              "ingredients":"3 cloves garlic, minced + 1 pinch kosher salt + 1 tablespoon dark soy sauce + 2 teaspoons red chile oil + 1 teaspoon Szechuan peppercorn oil + 1 teaspoon rice vinegar + ½ teaspoon sesame oil + 1 cup soybean sprouts + 1 cup Chinese noodles (La mian) + 1 teaspoon vegetable oil.",
              "time":"30 mins",
              "steps":"Step 1: Combine garlic and kosher salt together in a small bowl or mortar. Grind the garlic mixture with a wide spoon or pestle until paste is formed. --- Step 2: Combine garlic paste, soy sauce, red chile oil, peppercorn oil, rice vinegar, and sesame oil in a small bowl; stir until sauce is well mixed. --- Step 3: Fill a bowl with cold water. Bring a pot of water to a boil; stir in bean sprouts. Cook and stir until softened slightly, about 2 minutes; drain. Submerge bean sprouts in the cold water until cool. Transfer to a serving bowl. --- Step 4: Bring water to a boil in a pot; stir in noodles. Cook and stir until noodles are softened, about 3 minutes; drain. Submerge noodles in the cold water until cool. Transfer noodles to a bowl; mix in vegetable oil. Place noodles on top of the bean sprouts. Pour sauce onto noodles; mix until thoroughly combined.",
              "foodImage":"Sichuan (Szechuan) Cold Noodle",
              "review":"12"
              },
              {
              "foodName":"Vegetable Biryani",
              "ingredients":"2 tablespoons ghee (clarified butter), or olive oil + 1 red onion, cut into 1/2-inch dice + ½ teaspoon cumin seed + 1 (1 inch) piece cinnamon stick + 7 peppercorns + 1 tablespoon ginger garlic paste + 1 tomato, diced + ½ cup water + ½ cup peas + ½ cup diced carrot + ½ cup diced potato + 1 cube chicken bouillon + 1 teaspoon salt + ¼ teaspoon ground red chile pepper + ¼ teaspoon black pepper + ½ teaspoon garam masala + ¼ teaspoon ground turmeric + 4 cups water + 2 cups basmati rice, rinsed and drained",
              "time":"65 mins",
              "steps":"Step 1: Melt ghee in a large Dutch oven over medium heat. Add onion, and cook until softened, about 3 minutes. Stir in cumin seed, cinnamon stick, and peppercorns; cook until the spices are fragrant, and the cumin seeds begin to pop, about 3 minutes. --- Step 2: Stir in ginger garlic paste, tomatoes, and 1/2 cup water. Bring to a simmer, and cook until the water has evaporated, about 5 minutes. Stir in peas, carrot, and potato. Season with chicken bouillon, salt, red chile, black pepper, garam masala, and turmeric. Stir well, then cover, and cook for 3 minutes. --- Step 3: Pour in 4 cups water and bring to a boil over high heat. Once boiling, stir in basmati rice, reduce heat to medium, recover, and simmer for 10 minutes. Reduce heat to low and continue to cook until the rice has softened, 10 to 15 minutes more.",
              "foodImage":"Vegetable Biryani",
              "review":"13"
              },
              {
              "foodName":"Mama's Fab-u-lous Fajitas",
              "ingredients":"¼ cup lime juice + ¼ cup chopped fresh cilantro + ½ jalapeno pepper, seeded and minced + 2 tablespoons olive oil + 2 cloves garlic, minced + 1 teaspoon ground cumin + 1 ½ pounds beef skirt steak, cut across the grain into 1/2-inch strips + 1 yellow onion, cut into 1/2-inch strips + 3 red bell peppers, cut into 1/2-inch strips + 2 teaspoons vegetable oil, divided, or as needed",
              "time":"60 mins",
              "steps":"Step 1: Whisk lime juice, cilantro, jalapeno pepper, olive oil, garlic, and cumin together in a large glass or ceramic bowl. Add skirt steak, onion, and red bell peppers; toss to evenly coat. Cover the bowl with plastic wrap, and marinate in the refrigerator, 30 minutes to 2 hours. --- Step 2: Remove steak, onion, and peppers from marinade and shake off excess. Discard remaining marinade. --- Step 3: Heat 1 teaspoon vegetable oil in a large skillet over high heat until oil shimmers. Cook and stir steak in hot oil until browned on all sides and still pink in the center, about 3 minutes per side. Transfer meat to a plate, tent with aluminum foil, and let rest for 5 minutes. --- Step 4: Heat remaining oil in the same skillet over medium-high heat. Saute onion and peppers in hot oil until just tender but still crisp to the bite, 5 to 6 minutes. Return meat to skillet; cook and stir until heated through.",
              "foodImage":"Mama's Fab-u-lous Fajitas",
              "review":"14"
              }
]
}