{
    "foods": [
              { "foodName" : "Masala Dosa",
              "ingredients" : "FOR THE DOSA BATTER: 2 cups short-grain rice + ½ cup urad dal (split husked black lentils) + 1 teaspoon fenugreek seeds + ½ teaspoon salt + Vegetable oil, for frying, FOR THE POTATO FILLING: 3 tablespoons ghee or vegetable oil + 1 teaspoon mustard seeds + ½ teaspoon cumin seeds + 2 small dried hot red peppers +1 medium onion, diced + ½ teaspoon salt + ½ teaspoon turmeric + Pinch of asafetida + 1 tablespoon grated ginger + 6 to 8 curry leaves + 4 garlic cloves, minced + 2 small green chiles, finely chopped + 1 ½ pounds yellow-fleshed potatoes, such as Yukon Gold, boiled, peeled and cubed + ½ cup roughly chopped cilantro, leaves and tender stems",
              "time" : "1 hour, plus 12 to 14 hours’ soaking and fermenting",
              "steps" : "Step 1:  Make the dosa batter: Put rice in a bowl, rinse well and cover with 4 cups cold water. Put urad dal and fenugreek seeds in a small bowl, rinse well and add cold water to cover. Leave both to soak for 4 to 6 hours. --- Step 2: Drain rice and dal-fenugreek mixture in separate colanders. Put rice in a food processor, blender or wet-dry grinder. Add 1 cup cold water and grind to a smooth paste. It will take about 10 minutes, and it may be necessary to work in batches. Repeat the process with the dal-fenugreek mixture. --- Step 3: Combine the two pastes in a medium mixing bowl. Whisk together, adding enough water to obtain a medium-thick batter. You should have about 6 cups. Cover bowl with a kitchen towel and set in a warm place. Let ferment until the surface is bubbly, about 8 hours. Stir in the salt. Use the batter straight away or refrigerate for later use. (Batter will keep for up to a week, refrigerated. Thin with water if necessary before proceeding.) --- Step 4: Make the potato filling: Put ghee in a wide skillet over medium heat. When oil is wavy, add mustard seeds and cumin seeds. Wait for seeds to pop, about 1 minute, then add red peppers and onion. Cook, stirring until onions have softened, about 5 minutes. Season lightly with salt. Add turmeric, asafetida, ginger, curry leaves, garlic and green chile. Stir to coat and let sizzle for 1 minute.--- Step 5: Add potatoes and 1/2 cup water. Cook, stirring well to combine, until liquid has evaporated, about 5 minutes. Mash potatoes a bit with the back of a wooden spoon. Season well with salt, add cilantro, then set aside at room temperature. (Potato filling may be prepared up to a day in advance.) --- Step 6: To make dosas, set a griddle or cast-iron skillet over medium heat. Brush with about 1 teaspoon vegetable oil. Ladle 1/4 cup batter in the center of griddle. Using bottom of ladle, quickly spread batter outward in a circular motion to a diameter of about 7 inches. Drizzle 1/2 teaspoon oil over the top. Leave dosa batter to brown gradually until outer edges begin to look dry, about 2 minutes, cooking on one side only. With a spatula, carefully loosen dosa from griddle. Bottom should be crisp and beautifully browned. Spoon 1/2 cup potato filling onto top of dosa, centering it as a strip in the middle of the round dosa. Flatten the potato mixture slightly. Using the spatula, fold the sides of the dosa around the filling to make a cylindrical shape. Serve immediately. Continue making dosas one at a time.",
              "foodImage": "MasalaDosa"
              },
              { "foodName" : "Som tam",
              "ingredients" : "2 cups of shredded green papaya (or swede/rutabaga) + 2 tbs of toasted peanuts + 2 cloves of peeled garlic + 1-2 fresh birds eye chili (or more depending on tolerance) + 1 tbs of dried shrimp + ½ piece palm sugar + 7 cherry tomatoes + juice of ½ lime + 1½ tbs of fish sauce + 1-2 tbs Thai snake beans (or green beans) cut into 1 inch sticks",
              "time" : "30 minutes",
              "steps" : "Step 1:  Roughly crush a small handful of unsalted peanuts with mortar and pestle. Set aside. Wipe the mortar and pestle clean. --- Step 2: Melt palm sugar in a small pan at low or medium heat, adding 2 tbs of water. The cooking process should form a shiny and thick syrup. This makes it easier to mix the sugar with the salad. --- Step 3: Peel the papaya (or swede), shred it with a shredder (or a mandolin slicer) to thin strips and soak them in cold water while you prepare the rest of the salad. This makes the papaya crunchier and gets rid of any excess starch from the swede. --- Step 4: Cut the green beans into one-inch pieces. Throw away the endings. --- Step 5: Take the chilies and peeled garlic and give them a gentle bash with mortar and pestle. You still ought to see bits and pieces, not a puree. Add the shrimp and continue bashing. Add the crushed peanuts and mix well --- Step 6:Add the shredded papaya and continue bashing, but not too hard. Just enough so the mixture soaks up the flavours. Use a bigger spoon as a support tool, that way you can shift the salad in the mortar and it doesn’t fall out while bashing and mixing. --- Step 7: Add the liquid palm sugar, tomatoes, beans, lime juice and fish sauce. Continue to lightly bash, shift with the spoon, and mix a little more. --- Step 8: Serve on a big dish or bowl, sprinkle some crushed peanuts on top! Voila!",
              "foodImage": "som tam"
              },
              {
              "foodName": "Poutine",
              "ingredients": "1 quart vegetable oil for frying + 1 (10.25 ounce) can beef gravy + 5 medium potatoes, cut into fries + 2 cups cheese curds",
              "time" : "25 mins",
              "steps": "Step 1: Heat oil in a deep fryer or deep heavy skillet to 365 degrees F (185 degrees C). While the oil is heating, you can begin to warm your gravy. --- Step 2: Place the fries into the hot oil, and cook until light brown, about 5 minutes. Make the fries in batches if necessary to allow them room to move a little in the oil. Remove to a paper towel lined plate to drain. --- Step 3: Place the fries on a serving platter, and sprinkle the cheese over them. Ladle gravy over the fries and cheese, and serve immediately.",
              "foodImage": "poutine" },
              {
              "foodName": "Zesty Carnitas Tacos",
              "ingredients": "½ cup chopped onion: 1 (2 pound) boneless pork shoulder roast + ½ cup chopped onion + ⅓ cup orange juice + 1 tablespoon cumin + 1 ½ teaspoons kosher salt + 1 teaspoon dried oregano, crushed + ¼ teaspoon cayenne pepper, Lime Crema: 1 lime, zested and juiced + 2 (5.3 ounce) containers plain fat-free Greek yogurt + ½ teaspoon kosher salt + 1 pinch chili powder (Optional), Tacos: 16 (6 inch) soft yellow corn tortillas + 4 leaves green cabbage, shredded + 1 cup very thinly sliced red onion + 1 cup pico de gallo (Optional.",
              "time": "4 hrs 30 mins, for 8 people.",
              "steps": "Step 1: Carnitas: Trim fat from pork. Cut pork into 2- to 3-inch pieces; transfer to a 4-quart slow cooker. Stir in onion, orange juice, cumin, 1 1/2 teaspoons salt, oregano, and cayenne. --- Step 2: Cover and cook on Low 8 to 10 hours, or on High 4 to 5 hours. Transfer pork to a large bowl; shred using 2 forks. Add enough cooking liquid from slow cooker to moisten. --- Step 3: Lime Crema: Add 2 tablespoons lime juice to a small bowl. Stir in yogurt and 1/2 teaspoon salt. Dust with chili powder. --- Step 4: Tacos: Serve pork in tortillas with cabbage, red onion, and pico de gallo (if using). Garnish with crema and lime zest.",
              "foodImage": "Zesty Carnitas Tacos"
              },
              {
              "foodName": "Hummus",
              "ingredients":"2 cloves garlic, divided + 1 (19 ounce) can garbanzo beans, half the liquid reserved + 4 tablespoons lemon juice + 2 tablespoons tahini + 1 teaspoon salt + black pepper to taste + 2 tablespoons olive oil.",
              "time":"15 mins",
              "steps":"Step 1: In a blender, chop garlic. Pour garbanzo beans into the blender, reserving about 1 tablespoon for garnish. Add reserved liquid, lemon juice, tahini, and salt to the blender. Blend until creamy and well mixed. --- Step 2: Transfer the mixture to a medium serving bowl. Sprinkle with pepper and pour olive oil over the top. Garnish with reserved garbanzo beans.",
              "foodImage": "hummus"
              },
              {
              "foodName":"Maple syrup",
              "ingredients":"1 cup water + 1 cup white sugar + 1 cup brown sugar + 1 tablespoon maple flavored extract.",
              "time":"10 mins",
              "steps":"Step 1: Bring the water, white sugar, and brown sugar to a boil in a saucepan over medium-high heat. Reduce heat to medium-low, and stir in the maple extract; simmer 3 minutes longer.",
              "foodImage":"mappleSyrup"
              },
              {
              "foodName":"Authentic Pho",
              "ingredients":"4 pounds beef soup bones + 1 onion, unpeeled and cut in half + 5 slices fresh ginger + 1 tablespoon salt + 2 pods star anise + 2 ½ tablespoons fish sauce + 4 quarts water + 1 (8 ounce) package dried rice noodles + 1 ½ pounds beef top sirloin, thinly sliced + ½ cup chopped cilantro + 1 tablespoon chopped green onion + 1 ½ cups bean sprouts + 1 bunch Thai basil + 1 lime, cut into 4 wedges + ¼ cup hoisin sauce (Optional) + ¼ cup chile-garlic sauce (such as Sriracha®) (Optional).",
              "time":"9 hrs 20 mins, for 4 people.",
              "steps":"Step 1: Preheat oven to 425 degrees F (220 degrees C). --- Step 2: Place beef bones on a baking sheet and roast in the preheated oven until browned, about 1 hour. --- Step 3: Place onion on a baking sheet and roast in the preheated oven until blackened and soft, about 45 minutes. --- Step 4: Place bones, onion, ginger, salt, star anise, and fish sauce in a large stockpot and cover with 4 quarts of water. Bring to a boil and reduce heat to low. Simmer on low for 6 to 10 hours. Strain the broth into a saucepan and set aside. --- Step 5: Place rice noodles in large bowl filled with room temperature water and allow to soak for 1 hour. Bring a large pot of water to a boil and after the noodles have soaked, place them in the boiling water for 1 minute. Bring stock to a simmer. --- Step 6: Divide noodles among 4 serving bowls; top with sirloin, cilantro, and green onion. Pour hot broth over the top. Stir and let sit until the beef is partially cooked and no longer pink, 1 to 2 minutes. Serve with bean sprouts, Thai basil, lime wedges, hoisin sauce, and chile-garlic sauce on the side.",
              "foodImage":"Authentic Pho"
              }
]
}